title: Set Files as System Files Using attrib
id: 1a18225d-115b-40d5-b50f-d07b6499fded
related:
- id: efec536f-72e8-4656-8960-5e85d091345b
status: experimental
description: Detects the execution of "attrib" with the "+s" flag to mark files as
  system files and "+r" "h" mircop ransomware
references:
- https://app.any.run/tasks/df8f156e-9495-4494-8df8-bdc62f7fc6a8
author: SIMKRA
modified: 2024/05/10
tags:
- attack.defense_evasion
- attack.t1564.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \attrib.exe
  - OriginalFileName: ATTRIB.EXE
  selection_cli:
    CommandLine|contains: ' +s +r +h '
  condition: all of selection_*
falsepositives:
- Unknown
level: low
