title: Trendmicro IOC 3CX Desktop App
id: 4f196cb7-eab1-4007-b624-9fa29af7499b
status: experimental
description: Detects Trendmicro's IOCs of compromise for 3CX Desktop App 
references:
    - https://www.trendmicro.com/en_us/research/23/c/information-on-attacks-involving-3cx-desktop-app.html?utm_source=trendmicroresearch&utm_medium=smk&utm_campaign=0323_3cxApp
author: 'Simone Kraus (Orange Cyberdefense)'
date: 2023/04/02
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: process_creation
    product: windows 
logsource:
    category: process_creation
    product: macos   
detection:
    selection_hashes_Win64:
        Hashes|contains:
            - 'SHA256=dde03348075512796241389dfea5560c20a3d2a2eac95c894e7bbed5e85a0acc' # 3cxdesktopapp-18.12.407.msi
            - 'SHA256=aa124a4b4df12b34e74ee7f6c683b2ebec4ce9a8edcf9be345823b4fdcf5d868' #Installer Windows
            - 'SHA256=fad482ded2e25ce9e1dd3d3ecc3227af714bdfbbde04347dbc1b21d6a3670405'
            - 'SHA256=59e1edf4d82fae4978e97512b0331b7eb21dd4b838b850ba46794d9c7a2c0983' #Installer Windows
            - 'SHA256=c485674ee63ec8d4e8fde9800788175a8b02d3f9416d0e763360fff7f8eb4e02' #ffmpeg.dll 
            - 'SHA256=c485674ee63ec8d4e8fde9800788175a8b02d3f9416d0e763360fff7f8eb4e02' #ffmpeg.dll 
            - 'SHA256=11be1803e2e307b647a8a7e02d128335c448ff741bf06bf52b332e0bbf423b03' #d3dcompiler.dll
            - 'SHA256=4e08e4ffc699e0a1de4a5225a0b4920933fbb9cf123cde33e1674fde6d61444f' 
            - 'SHA256=8ab3a5eaaf8c296080fadf56b265194681d7da5da7c02562953a4cb60e147423 ' #Stealer
            
    selection_hashes_Mac:
         Hashes|contains:
            - 'SHA256=5a017652531eebfcef7011c37a04f11621d89084f8f9507201f071ce359bea3f'
            - 'SHA256=5407cda7d3a75e7b1e030b1f33337a56f293578ffa8b3ae19c671051ed314290'
            - 'SHA256=fee4f9dabc094df24d83ec1a8c4e4ff573e5d9973caa676f58086c99561382d7' 
            - 'SHA256=5009c7d1590c1f8c05827122172583ddf924c53b55a46826abf66da46725505a' 
            - 'SHA256=e6bbc33815b9f20b0cf832d7401dd893fbc467c800728b5891336706da0dbce' 
            - 'SHA256=a64fa9f1c76457ecc58402142a8728ce34ccba378c17318b3340083eeb7acc67' 
            - 'SHA256=87c5d0c93b80acf61d24e7aaf0faae231ab507ca45483ad3d441b5d1acebc43c' 
    selection_installer_1:
        - OriginalFileName: '3cxdesktopapp-18.12.407.msi'
        - Image|endswith:   '\3cxdesktopapp-18.12.407.msi'
        - Product: '3CX Desktop App'
    selection_installer_2:
        - OriginalFileName: '3CX Desktop App-darwin-x64-18.11.1213.zip' #for Mac trojan Trojan.MacOS.FAKE3L3CTRON.A
        - Product: '3CX Desktop App'
    selection_installer_3:
     FileVersion|contains:
            - '18.12.407'
            - '18.12.416'
    condition: all of selection_installer_* or 1 of selection_hashes_*
falsepositives:
    - Legitimate usage of 3CXDesktopApp
level: high